In [145]:
import pandas as pd

# Series

In [146]:
temp = pd.Series([10,20,30,40])
print(temp)

0    10
1    20
2    30
3    40
dtype: int64

In [147]:
temp[0]

10

# Series Index 설정

In [148]:
temp = pd.Series([10,20,30,40], index=['One','Two','Three','Four'])
print(temp)

One      10
Two      20
Three    30
Four     40
dtype: int64

In [149]:
temp['One']

10

# DataFrame

In [150]:
data = {
    '이름' : ['A','B','C','D','E'],
    '나이' : [14,15,16,17,18],
    '번호' : [1,2,3,4,5]
} #객체 형태
data

{'이름': ['A', 'B', 'C', 'D', 'E'],
 '나이': [14, 15, 16, 17, 18],
 '번호': [1, 2, 3, 4, 5]}

In [151]:
type(data)

dict

In [152]:
df = pd.DataFrame(data)
df

  이름  나이  번호
0  A  14   1
1  B  15   2
2  C  16   3
3  D  17   4
4  E  18   5

In [153]:
df[['이름', '번호']]

  이름  번호
0  A   1
1  B   2
2  C   3
3  D   4
4  E   5

# DataFrame Index 설정

In [154]:
df = pd.DataFrame(data, index = ['첫번째','두번째','세번째','네번째','다섯번째'])
df

     이름  나이  번호
첫번째   A  14   1
두번째   B  15   2
세번째   C  16   3
네번째   D  17   4
다섯번째  E  18   5

# DataFrame Columns 설정

In [155]:
df = pd.DataFrame(data, columns=['이름','번호','나이'])
df

  이름  번호  나이
0  A   1  14
1  B   2  15
2  C   3  16
3  D   4  17
4  E   5  18

In [156]:
df.index.name='선수번호'
df

     이름  번호  나이
선수번호
0     A   1  14
1     B   2  15
2     C   3  16
3     D   4  17
4     E   5  18

In [157]:
df.set_index('이름')

    번호  나이
이름
A    1  14
B    2  15
C    3  16
D    4  17
E    5  18

In [158]:
df.sort_index(ascending = False) #내림차순 정렬, True 일 경우 오름차순

     이름  번호  나이
선수번호
4     E   5  18
3     D   4  17
2     C   3  16
1     B   2  15
0     A   1  14

In [159]:
data = {
    '이름' : ['A','B','C','D','E'],
    '나이' : [14,15,16,17,18],
    '번호' : [1,2,3,4,5],
    '국어' : [55,66,77,88,99],
    '수학' : [33,22,44,11,66],
    '영어' : [11,22,11,66,32]
} #객체 형태
df = pd.DataFrame(data)
df

  이름  나이  번호  국어  수학  영어
0  A  14   1  55  33  11
1  B  15   2  66  22  22
2  C  16   3  77  44  11
3  D  17   4  88  11  66
4  E  18   5  99  66  32

# 파일로 저장하기

In [160]:
df = pd.DataFrame(data, index = [1,2,3,4,5])
df

  이름  나이  번호  국어  수학  영어
1  A  14   1  55  33  11
2  B  15   2  66  22  22
3  C  16   3  77  44  11
4  D  17   4  88  11  66
5  E  18   5  99  66  32

In [161]:
df.index.name = '순위'

In [162]:
df

   이름  나이  번호  국어  수학  영어
순위
1   A  14   1  55  33  11
2   B  15   2  66  22  22
3   C  16   3  77  44  11
4   D  17   4  88  11  66
5   E  18   5  99  66  32

In [163]:
data = {
    '이름' : ['Kanye','Tyler','Wayne','Yachty','Drake'],
    '나이' : [42,31,43,24,33],
    '음악' : [100,95,52,88,12],
    '국어' : [55,66,77,88,99],
    '수학' : [33,22,44,11,66],
    '영어' : [11,22,11,66,32]
} #객체 형태
df = pd.DataFrame(data, index=[1,2,3,4,5])
df.index.name = '순위'
df
#df.to_csv('ranking.csv', encoding='utf-8-sig') #csv 파일로 변환, 위치 : C:\Users\Speria\anaconda3\Scripts\Python

        이름  나이   음악  국어  수학  영어
순위
1    Kanye  42  100  55  33  11
2    Tyler  31   95  66  22  22
3    Wayne  43   52  77  44  11
4   Yachty  24   88  88  11  66
5    Drake  33   12  99  66  32

In [164]:
#df.to_csv('ranking.txt', sep='\t') #표처럼 만들기

# 파일 열기

In [165]:
#df = pd.read_csv('ranking.csv') #skiprows : 처음 n줄 무시, nrows : n줄만 가져옴

In [166]:
data = {
    '이름' : ['Kanye','Tyler','Wayne','Yachty','Drake', 'Frank', 'Kendrick'],
    '나이' : [42,31,43,24,33,32,38],
    '음악' : [100,95,52,88,12,99,89],
    '국어' : [55,66,77,88,99,71,99],
    '수학' : [33,22,44,11,66,88,11],
    '영어' : [11,22,11,66,32,74,92],
    '학교' : ['Chicago', 'Odd Future', 'Ohio', 'Ohio', 'Toronto', 'Blonded', 'Compton']
} #객체 형태
df = pd.DataFrame(data, index=['1위','2위','3위','4위','5위','6위','7위'])
df.index.name = '순위'
df

          이름  나이   음악  국어  수학  영어          학교
순위
1위     Kanye  42  100  55  33  11     Chicago
2위     Tyler  31   95  66  22  22  Odd Future
3위     Wayne  43   52  77  44  11        Ohio
4위    Yachty  24   88  88  11  66        Ohio
5위     Drake  33   12  99  66  32     Toronto
6위     Frank  32   99  71  88  74     Blonded
7위  Kendrick  38   89  99  11  92     Compton

# DataFrame 확인

In [167]:
df.describe()

              나이          음악         국어         수학         영어
count   7.000000    7.000000   7.000000   7.000000   7.000000
mean   34.714286   76.428571  79.285714  39.285714  44.000000
std     6.725927   32.786466  16.799943  29.004105  32.898835
min    24.000000   12.000000  55.000000  11.000000  11.000000
25%    31.500000   70.000000  68.500000  16.500000  16.500000
50%    33.000000   89.000000  77.000000  33.000000  32.000000
75%    40.000000   97.000000  93.500000  55.000000  70.000000
max    43.000000  100.000000  99.000000  88.000000  92.000000

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 1위 to 7위
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   음악      7 non-null      int64
 3   국어      7 non-null      int64
 4   수학      7 non-null      int64
 5   영어      7 non-null      int64
 6   학교      7 non-null      object
dtypes: int64(5), object(2)
memory usage: 448.0+ bytes

In [169]:
df.head()  #처음 다섯개의 row 를 불러오기

        이름  나이   음악  국어  수학  영어          학교
순위
1위   Kanye  42  100  55  33  11     Chicago
2위   Tyler  31   95  66  22  22  Odd Future
3위   Wayne  43   52  77  44  11        Ohio
4위  Yachty  24   88  88  11  66        Ohio
5위   Drake  33   12  99  66  32     Toronto

In [170]:
df.head(2) #처음 두개의 row 를 불러오기

       이름  나이   음악  국어  수학  영어          학교
순위
1위  Kanye  42  100  55  33  11     Chicago
2위  Tyler  31   95  66  22  22  Odd Future

In [171]:
df.sample() #아무 row 나 가져오기

       이름  나이  음악  국어  수학  영어    학교
순위
3위  Wayne  43  52  77  44  11  Ohio

In [172]:
df.tail(2) #마지막 2개의 row 를 가져오기

          이름  나이  음악  국어  수학  영어       학교
순위
6위     Frank  32  99  71  88  74  Blonded
7위  Kendrick  38  89  99  11  92  Compton

In [173]:
df.values

array([['Kanye', 42, 100, 55, 33, 11, 'Chicago'],
       ['Tyler', 31, 95, 66, 22, 22, 'Odd Future'],
       ['Wayne', 43, 52, 77, 44, 11, 'Ohio'],
       ['Yachty', 24, 88, 88, 11, 66, 'Ohio'],
       ['Drake', 33, 12, 99, 66, 32, 'Toronto'],
       ['Frank', 32, 99, 71, 88, 74, 'Blonded'],
       ['Kendrick', 38, 89, 99, 11, 92, 'Compton']], dtype=object)

In [174]:
df.index

Index(['1위', '2위', '3위', '4위', '5위', '6위', '7위'], dtype='object', name='순위')

In [175]:
df.columns

Index(['이름', '나이', '음악', '국어', '수학', '영어', '학교'], dtype='object')

In [176]:
df.shape #(row, column)

(7, 7)

In [177]:
df

          이름  나이   음악  국어  수학  영어          학교
순위
1위     Kanye  42  100  55  33  11     Chicago
2위     Tyler  31   95  66  22  22  Odd Future
3위     Wayne  43   52  77  44  11        Ohio
4위    Yachty  24   88  88  11  66        Ohio
5위     Drake  33   12  99  66  32     Toronto
6위     Frank  32   99  71  88  74     Blonded
7위  Kendrick  38   89  99  11  92     Compton

In [178]:
df['음악'].min() #음악 부문 최하점

12

In [179]:
df['수학'].max()

88

In [180]:
df['음악'].nlargest(3) #가장 점수 높은 순서대로 3명

순위
1위    100
6위     99
2위     95
Name: 음악, dtype: int64

In [181]:
df['음악'].mean() #음악 부문 평균 #sum은 합계

76.42857142857143

In [182]:
df['영어'].count() #존재하는 데이터는 몇개인가

7

In [183]:
df['학교'].unique()

array(['Chicago', 'Odd Future', 'Ohio', 'Toronto', 'Blonded', 'Compton'],
      dtype=object)

In [184]:
df['학교'].nunique()

6

# 데이터 선택 (기본)

## Column 선택 (label)

In [185]:
df['이름'] #이름에 대한 데이터를 가져온 것

순위
1위       Kanye
2위       Tyler
3위       Wayne
4위      Yachty
5위       Drake
6위       Frank
7위    Kendrick
Name: 이름, dtype: object

### Index 이용

In [186]:
df.columns

Index(['이름', '나이', '음악', '국어', '수학', '영어', '학교'], dtype='object')

In [187]:
df.columns[0]

'이름'

In [188]:
df[df.columns[0]] #Index 값을 이용해 불러왔다, df['이름'] 과 동일한 동작

순위
1위       Kanye
2위       Tyler
3위       Wayne
4위      Yachty
5위       Drake
6위       Frank
7위    Kendrick
Name: 이름, dtype: object

In [189]:
df[df.columns[-1]] #맨 끝에 있는 '학교' 를 가져옴

순위
1위       Chicago
2위    Odd Future
3위          Ohio
4위          Ohio
5위       Toronto
6위       Blonded
7위       Compton
Name: 학교, dtype: object

### 슬라이싱

In [190]:
df['영어'][0:3] #인덱스 0 부터 2 까지의 영어 점수를 가져온다

순위
1위    11
2위    22
3위    11
Name: 영어, dtype: int64

In [191]:
df[['음악','국어']][0:4] #인덱스 0에서 3 까지의 음악과 국어 점수 가져오기

     음악  국어
순위
1위  100  55
2위   95  66
3위   52  77
4위   88  88

In [192]:
df[3:6] #인덱스 3에서 5까지 가져온다, 인덱스를 1번부터 설정했으므로 3,4,5 는 실제로 4위 5위 6위

        이름  나이  음악  국어  수학  영어       학교
순위
4위  Yachty  24  88  88  11  66     Ohio
5위   Drake  33  12  99  66  32  Toronto
6위   Frank  32  99  71  88  74  Blonded

# 데이터 선택 (loc)
이름을 이용하여 원하는 row 에서 원하는 column 선택

In [193]:
df

          이름  나이   음악  국어  수학  영어          학교
순위
1위     Kanye  42  100  55  33  11     Chicago
2위     Tyler  31   95  66  22  22  Odd Future
3위     Wayne  43   52  77  44  11        Ohio
4위    Yachty  24   88  88  11  66        Ohio
5위     Drake  33   12  99  66  32     Toronto
6위     Frank  32   99  71  88  74     Blonded
7위  Kendrick  38   89  99  11  92     Compton

In [195]:
df.loc['1위'] #1위 학생의 정보를 불러온다

이름      Kanye
나이         42
음악        100
국어         55
수학         33
영어         11
학교    Chicago
Name: 1위, dtype: object

In [196]:
df.loc['1위', '음악'] #1위의 음악 성적을 불러온다

100

In [197]:
df.loc[['1위','2위','3위','4위'], ['음악','영어','국어']] #1위,2위,3위,4위의 음악 영어 국어 성적을 불러온다

     음악  영어  국어
순위
1위  100  11  55
2위   95  22  66
3위   52  11  77
4위   88  66  88

In [199]:
df.loc['1위':'5위'] #1위 에서 5위 까지의 정보를 불러온다, 인덱스를 직접 '5위' 와 같이 쓰면 5위를 포함해서 가져온다

        이름  나이   음악  국어  수학  영어          학교
순위
1위   Kanye  42  100  55  33  11     Chicago
2위   Tyler  31   95  66  22  22  Odd Future
3위   Wayne  43   52  77  44  11        Ohio
4위  Yachty  24   88  88  11  66        Ohio
5위   Drake  33   12  99  66  32     Toronto

# 데이터 선택 (iloc)
인덱스 이름이 아닌 위치를 이용하여 원하는 column 선택

In [204]:
df.iloc[0] #0번째 위치 = 1위 = Kanye

이름      Kanye
나이         42
음악        100
국어         55
수학         33
영어         11
학교    Chicago
Name: 1위, dtype: object

In [205]:
df.iloc[0:4] #4를 포함하지 않고 0,1,2,3번째 -> 1위, 2위, 3위, 4위

        이름  나이   음악  국어  수학  영어          학교
순위
1위   Kanye  42  100  55  33  11     Chicago
2위   Tyler  31   95  66  22  22  Odd Future
3위   Wayne  43   52  77  44  11        Ohio
4위  Yachty  24   88  88  11  66        Ohio

In [215]:
df.iloc[[0,1,2], [0,1,2]] #[[0,1,2], [0,1,2]] -> 0번째, 1번째, 2번째의 순위 이름 나이 음악을 가져온다 (순위는 인덱스, 항상 포함)

       이름  나이   음악
순위
1위  Kanye  42  100
2위  Tyler  31   95
3위  Wayne  43   52

In [217]:
df.iloc[0:3, 0:3] #위와 같지만 슬라이싱을 이용

       이름  나이   음악
순위
1위  Kanye  42  100
2위  Tyler  31   95
3위  Wayne  43   52

# 데이터 선택 (조건)
조건에 해당하는 데이터 선택

In [218]:
df

          이름  나이   음악  국어  수학  영어          학교
순위
1위     Kanye  42  100  55  33  11     Chicago
2위     Tyler  31   95  66  22  22  Odd Future
3위     Wayne  43   52  77  44  11        Ohio
4위    Yachty  24   88  88  11  66        Ohio
5위     Drake  33   12  99  66  32     Toronto
6위     Frank  32   99  71  88  74     Blonded
7위  Kendrick  38   89  99  11  92     Compton

In [221]:
df['음악'] > 60

순위
1위     True
2위     True
3위    False
4위     True
5위    False
6위     True
7위     True
Name: 음악, dtype: bool

In [225]:
filt = (df['음악'] > 60)
df[filt]

          이름  나이   음악  국어  수학  영어          학교
순위
1위     Kanye  42  100  55  33  11     Chicago
2위     Tyler  31   95  66  22  22  Odd Future
4위    Yachty  24   88  88  11  66        Ohio
6위     Frank  32   99  71  88  74     Blonded
7위  Kendrick  38   89  99  11  92     Compton

In [230]:
df.loc[filt, ['이름', '나이', '음악']] #loc -> filt 를 만족시키는 항목의 [무엇] 을 불러오는가? [대상, 항목]

          이름  나이   음악
순위
1위     Kanye  42  100
2위     Tyler  31   95
4위    Yachty  24   88
6위     Frank  32   99
7위  Kendrick  38   89

In [232]:
df.loc[(df['음악'] > 80) & (df['나이'] > 35) , ['이름','나이','음악']] #음악이 80점, 나이가 35살 넘는 사람들의 [이름, 나이, 음악]을 불러와라

          이름  나이   음악
순위
1위     Kanye  42  100
7위  Kendrick  38   89

### str 함수

In [ ]:
#1:34:34